garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1574.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWMOUT" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWMOUT" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xD90">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM1OUT_A" edc:desc="" edc:mask="0x1" edc:name="PWM1OUT_A" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2OUT_A" edc:desc="" edc:mask="0x1" edc:name="PWM2OUT_A" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3OUT_A" edc:desc="" edc:mask="0x1" edc:name="PWM3OUT_A" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4OUT_A" edc:desc="" edc:mask="0x1" edc:name="PWM4OUT_A" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MPWM1OUT" edc:desc="" edc:mask="0x1" edc:name="MPWM1OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MPWM2OUT" edc:desc="" edc:mask="0x1" edc:name="MPWM2OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MPWM3OUT" edc:desc="" edc:mask="0x1" edc:name="MPWM3OUT" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM1PH" edc:desc="" edc:name="PWM1PH" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD91">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1PHL" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM1PHL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD91">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PH" edc:desc="" edc:mask="0xff" edc:name="PH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM1PHL0" edc:desc="" edc:mask="0x1" edc:name="PWM1PHL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PHL1" edc:desc="" edc:mask="0x1" edc:name="PWM1PHL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PHL2" edc:desc="" edc:mask="0x1" edc:name="PWM1PHL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PHL3" edc:desc="" edc:mask="0x1" edc:name="PWM1PHL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PHL4" edc:desc="" edc:mask="0x1" edc:name="PWM1PHL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PHL5" edc:desc="" edc:mask="0x1" edc:name="PWM1PHL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PHL6" edc:desc="" edc:mask="0x1" edc:name="PWM1PHL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PHL7" edc:desc="" edc:mask="0x1" edc:name="PWM1PHL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM1PHL" edc:desc="" edc:mask="0xff" edc:name="PWM1PHL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1PHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM1PHH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD92">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PH" edc:desc="" edc:mask="0xff" edc:name="PH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM1PHH0" edc:desc="" edc:mask="0x1" edc:name="PWM1PHH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PHH1" edc:desc="" edc:mask="0x1" edc:name="PWM1PHH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PHH2" edc:desc="" edc:mask="0x1" edc:name="PWM1PHH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PHH3" edc:desc="" edc:mask="0x1" edc:name="PWM1PHH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PHH4" edc:desc="" edc:mask="0x1" edc:name="PWM1PHH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PHH5" edc:desc="" edc:mask="0x1" edc:name="PWM1PHH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PHH6" edc:desc="" edc:mask="0x1" edc:name="PWM1PHH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1PHH7" edc:desc="" edc:mask="0x1" edc:name="PWM1PHH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM1PHH" edc:desc="" edc:mask="0xff" edc:name="PWM1PHH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM1DC" edc:desc="" edc:name="PWM1DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD93">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1DCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM1DCL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD93">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM1DCL0" edc:desc="" edc:mask="0x1" edc:name="PWM1DCL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1DCL1" edc:desc="" edc:mask="0x1" edc:name="PWM1DCL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1DCL2" edc:desc="" edc:mask="0x1" edc:name="PWM1DCL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1DCL3" edc:desc="" edc:mask="0x1" edc:name="PWM1DCL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1DCL4" edc:desc="" edc:mask="0x1" edc:name="PWM1DCL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1DCL5" edc:desc="" edc:mask="0x1" edc:name="PWM1DCL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1DCL6" edc:desc="" edc:mask="0x1" edc:name="PWM1DCL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1DCL7" edc:desc="" edc:mask="0x1" edc:name="PWM1DCL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM1DCL" edc:desc="" edc:mask="0xff" edc:name="PWM1DCL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
