garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1574.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM2DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM2DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA4">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM2DCH0" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2DCH1" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2DCH2" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2DCH3" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2DCH4" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2DCH5" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2DCH6" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2DCH7" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM2DCH" edc:desc="" edc:mask="0xff" edc:name="PWM2DCH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM2PR" edc:desc="" edc:name="PWM2PR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA5">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM2PRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM2PRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA5">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM2PRL0" edc:desc="" edc:mask="0x1" edc:name="PWM2PRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PRL1" edc:desc="" edc:mask="0x1" edc:name="PWM2PRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PRL2" edc:desc="" edc:mask="0x1" edc:name="PWM2PRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PRL3" edc:desc="" edc:mask="0x1" edc:name="PWM2PRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PRL4" edc:desc="" edc:mask="0x1" edc:name="PWM2PRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PRL5" edc:desc="" edc:mask="0x1" edc:name="PWM2PRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PRL6" edc:desc="" edc:mask="0x1" edc:name="PWM2PRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PRL7" edc:desc="" edc:mask="0x1" edc:name="PWM2PRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM2PRL" edc:desc="" edc:mask="0xff" edc:name="PWM2PRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM2PRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM2PRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA6">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM2PRH0" edc:desc="" edc:mask="0x1" edc:name="PWM2PRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PRH1" edc:desc="" edc:mask="0x1" edc:name="PWM2PRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PRH2" edc:desc="" edc:mask="0x1" edc:name="PWM2PRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PRH3" edc:desc="" edc:mask="0x1" edc:name="PWM2PRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PRH4" edc:desc="" edc:mask="0x1" edc:name="PWM2PRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PRH5" edc:desc="" edc:mask="0x1" edc:name="PWM2PRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PRH6" edc:desc="" edc:mask="0x1" edc:name="PWM2PRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PRH7" edc:desc="" edc:mask="0x1" edc:name="PWM2PRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM2PRH" edc:desc="" edc:mask="0xff" edc:name="PWM2PRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM2OF" edc:desc="" edc:name="PWM2OF" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA7">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM2OFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM2OFL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA7">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM2OFL0" edc:desc="" edc:mask="0x1" edc:name="PWM2OFL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2OFL1" edc:desc="" edc:mask="0x1" edc:name="PWM2OFL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2OFL2" edc:desc="" edc:mask="0x1" edc:name="PWM2OFL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2OFL3" edc:desc="" edc:mask="0x1" edc:name="PWM2OFL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2OFL4" edc:desc="" edc:mask="0x1" edc:name="PWM2OFL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2OFL5" edc:desc="" edc:mask="0x1" edc:name="PWM2OFL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2OFL6" edc:desc="" edc:mask="0x1" edc:name="PWM2OFL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2OFL7" edc:desc="" edc:mask="0x1" edc:name="PWM2OFL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM2OFL" edc:desc="" edc:mask="0xff" edc:name="PWM2OFL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
