garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1574.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM4OFH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM4OFH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC8">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM4OFH0" edc:desc="" edc:mask="0x1" edc:name="PWM4OFH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4OFH1" edc:desc="" edc:mask="0x1" edc:name="PWM4OFH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4OFH2" edc:desc="" edc:mask="0x1" edc:name="PWM4OFH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4OFH3" edc:desc="" edc:mask="0x1" edc:name="PWM4OFH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4OFH4" edc:desc="" edc:mask="0x1" edc:name="PWM4OFH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4OFH5" edc:desc="" edc:mask="0x1" edc:name="PWM4OFH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4OFH6" edc:desc="" edc:mask="0x1" edc:name="PWM4OFH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4OFH7" edc:desc="" edc:mask="0x1" edc:name="PWM4OFH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM4OFH" edc:desc="" edc:mask="0xff" edc:name="PWM4OFH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM4TMR" edc:desc="" edc:name="PWM4TMR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC9">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM4TMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM4TMRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC9">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM4TMRL0" edc:desc="" edc:mask="0x1" edc:name="PWM4TMRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4TMRL1" edc:desc="" edc:mask="0x1" edc:name="PWM4TMRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4TMRL2" edc:desc="" edc:mask="0x1" edc:name="PWM4TMRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4TMRL3" edc:desc="" edc:mask="0x1" edc:name="PWM4TMRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4TMRL4" edc:desc="" edc:mask="0x1" edc:name="PWM4TMRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4TMRL5" edc:desc="" edc:mask="0x1" edc:name="PWM4TMRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4TMRL6" edc:desc="" edc:mask="0x1" edc:name="PWM4TMRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4TMRL7" edc:desc="" edc:mask="0x1" edc:name="PWM4TMRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM4TMRL" edc:desc="" edc:mask="0xff" edc:name="PWM4TMRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM4TMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM4TMRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDCA">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM4TMRH0" edc:desc="" edc:mask="0x1" edc:name="PWM4TMRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4TMRH1" edc:desc="" edc:mask="0x1" edc:name="PWM4TMRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4TMRH2" edc:desc="" edc:mask="0x1" edc:name="PWM4TMRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4TMRH3" edc:desc="" edc:mask="0x1" edc:name="PWM4TMRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4TMRH4" edc:desc="" edc:mask="0x1" edc:name="PWM4TMRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4TMRH5" edc:desc="" edc:mask="0x1" edc:name="PWM4TMRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4TMRH6" edc:desc="" edc:mask="0x1" edc:name="PWM4TMRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4TMRH7" edc:desc="" edc:mask="0x1" edc:name="PWM4TMRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM4TMRH" edc:desc="" edc:mask="0xff" edc:name="PWM4TMRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnrnnn--" edc:cname="PWM4CON" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000--" edc:name="PWM4CON" edc:nzwidth="8" edc:por="000000--" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDCB">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM4MODE0" edc:desc="" edc:mask="0x1" edc:name="PWM4MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4MODE1" edc:desc="" edc:mask="0x1" edc:name="PWM4MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM4MODE" edc:desc="" edc:mask="0x3" edc:name="PWM4MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PWM4POL" edc:desc="" edc:mask="0x1" edc:name="PWM4POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4OUT" edc:desc="" edc:mask="0x1" edc:name="PWM4OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4OE" edc:desc="" edc:mask="0x1" edc:name="PWM4OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4EN" edc:desc="" edc:mask="0x1" edc:name="PWM4EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWM4INTE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM4INTE" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDCC">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM4INTCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRIE" edc:desc="" edc:mask="0x1" edc:name="PRIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DCIE" edc:desc="" edc:mask="0x1" edc:name="DCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHIE" edc:desc="" edc:mask="0x1" edc:name="PHIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFIE" edc:desc="" edc:mask="0x1" edc:name="OFIE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM4PRIE" edc:desc="" edc:mask="0x1" edc:name="PWM4PRIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4DCIE" edc:desc="" edc:mask="0x1" edc:name="PWM4DCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4PHIE" edc:desc="" edc:mask="0x1" edc:name="PWM4PHIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4OFIE" edc:desc="" edc:mask="0x1" edc:name="PWM4OFIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
